using Items;

// -----------------------------------------------------------------------------
// Назначение файла: PhotoCameraTool.cs
// Путь: Assets/Scripts/Items/PhotoCameraTool.cs
// Описание: Содержит игровую логику, связанную с данным компонентом.
// Примечание: Комментарии добавлены для ускорения поддержки и онбординга.
// -----------------------------------------------------------------------------

/// <summary>
/// Реализует компонент `PhotoCameraTool` и инкапсулирует связанную с ним игровую логику.
/// </summary>
public class PhotoCameraTool : ToolItem
{
    // Можно добавить специфическое поведение
}