// -----------------------------------------------------------------------------
// Назначение файла: ToolType.cs
// Путь: Assets/Scripts/Items/ToolType.cs
// Описание: Содержит игровую логику, связанную с данным компонентом.
// Примечание: Комментарии добавлены для ускорения поддержки и онбординга.
// -----------------------------------------------------------------------------

namespace Items
{
    /// <summary>
    /// Перечисляет набор значений `ToolType`, используемых в игровой логике.
    /// </summary>
    public enum ToolType
    {
        Tablet,
        Scissors,
        PhotoCamera,
        // другие...
        None
    }
}